Revit 2027 API
FileImportedEventArgs.ImportedInstanceId Property
 The ElementId of the imported instance that represents the imported object(s) after a successful import. It could be used for further manipulation of that instance.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ImportedInstanceId { get; }
Public ReadOnly Property ImportedInstanceId As ElementId
	Get
public:
property ElementId^ ImportedInstanceId {
	ElementId^ get ();
}
member ImportedInstanceId : ElementId with get
Property Value
ElementId
Remarks
 The value could be InvalidElementId for some type of import formats, such as GBXML and Inventor files.
See Also
Reference
FileImportedEventArgs Class
Autodesk.Revit.DB.Events Namespace